import UIKit

class EngineVolumeDataSources: NSObject {
    
    var enginesVolume = [
        "0.2 л.",
        "0.4 л.",
        "0.6 л.",
        "0.8 л.",
        "1.0 л.",
        "1.2 л.",
        "1.4 л.",
        "1.6 л.",
        "1.8 л.",
        "2.0 л.",
        "2.2 л.",
        "2.4 л.",
        "2.6 л.",
        "2.8 л.",
        "3.0 л.",
        "3.5 л.",
        "4.0 л.",
        "4.5 л.",
        "5.0 л.",
        "5.5 л.",
        "6.0 л.",
        "7.0 л.",
        "8.0 л.",
        "9.0 л.",
        "10.0 л."
    ]
    
}
