import UIKit

class TownDataSourses: NSObject {
    
    var townsAdygea = [
        "Адыгейск",
        "Майкоп"
    ]
    
    var townsAltai  = [
        "Алейск",
        "Барнаул",
        "Белокуриха",
        "Бийск",
        "Горняк",
        "Заринск",
        "Змеиногорск",
        "Камень-на-Оби",
        "Новоалтайск",
        "Рубцовск",
        "Славгород",
        "Яровое"
    ]
    
    var townsAmursk  = [
        "Благовещенск",
        "Завитинск",
        "Зея",
        "Райчихинск",
        "Свободный",
        "Сковородино",
        "Тында",
        "Циолковский",
        "Шимановск"
    ]
    
    var townsArhangelsk  = [
        "Архангельск",
        "Вельск",
        "Каргополь",
        "Коряжма",
        "Котлас",
        "Мезень",
        "Мирный",
        "Новодвинск",
        "Няндома",
        "Онега",
        "Северодвинск",
        "Сольвычегодск",
        "Шенкурск"
    ]
    
    var townsAstrahan  = [
        "Астрахань",
        "Ахтубинск",
        "Знаменск",
        "Камызяк",
        "Нариманов",
        "Харабали"
    ]
    
    var townsBashkortostan  = [
        "Агидель",
        "Баймак",
        "Белебей",
        "Белорецк",
        "Бирск",
        "Благовещенск",
        "Давлеканово",
        "Дюртюли",
        "Ишимбай",
        "Кумертау",
        "Межгорье",
        "Мелеуз",
        "Нефтекамск",
        "Октябрьский",
        "Салават",
        "Сибай",
        "Стерлитамак",
        "Туймазы",
        "Уфа",
        "Учалы",
        "Янаул"
    ]
    
    var townsBelgorod  = [
        "Алексеевка",
        "Белгород",
        "Бирюч",
        "Валуйки",
        "Грайворон",
        "Губкин",
        "Короча",
        "Новый Оскол",
        "Старый Оскол",
        "Строитель",
        "Шебекино"
    ]
    
    var townsBryansk   = [
        "Брянск",
        "Дятьково",
        "Жуковка",
        "Злынка",
        "Карачев",
        "Клинцы",
        "Мглин",
        "Новозыбков",
        "Почеп",
        "Севск",
        "Сельцо",
        "Стародуб",
        "Сураж",
        "Трубчевск",
        "Унеча",
        "Фокино"
    ]
    
    var townsBuryatia  = [
        "Бабушкин",
        "Гусиноозёрск",
        "Закаменск",
        "Кяхта",
        "Северобайкальск",
        "Улан-Удэ"
    ]
    
    var townsVladimir  = [
        "Александров",
        "Владимир",
        "Вязники",
        "Гороховец",
        "Гусь-Хрустальный",
        "Камешково",
        "Карабаново",
        "Киржач",
        "Ковров",
        "Кольчугино",
        "Костерёво",
        "Курлово",
        "Лакинск",
        "Меленки",
        "Муром",
        "Петушки",
        "Покров",
        "Радужный",
        "Собинка",
        "Струнино",
        "Судогда",
        "Суздаль",
        "Юрьев-Польский"
    ]
    
    var townsVolgograd  = [
        "Волгоград",
        "Волжский",
        "Дубовка",
        "Жирновск",
        "Калач-на-Дону",
        "Камышин",
        "Котельниково",
        "Котово",
        "Краснослободск",
        "Ленинск",
        "Михайловка",
        "Николаевск",
        "Новоаннинский",
        "Палласовка",
        "Петров Вал",
        "Серафимович",
        "Суровикино",
        "Урюпинск",
        "Фролово"
    ]
    
    var townsVologodsk  = [
        "Бабаево",
        "Белозерск",
        "Великий Устюг",
        "Вологда",
        "Вытегра",
        "Грязовец",
        "Кадников",
        "Кириллов",
        "Красавино",
        "Никольск",
        "Сокол",
        "Тотьма",
        "Устюжна",
        "Харовск",
        "Череповец"
    ]
    
    var townsVoronezh  = [
        "Бобров",
        "Богучар",
        "Борисоглебск",
        "Бутурлиновка",
        "Воронеж",
        "Калач",
        "Лиски",
        "Нововоронеж",
        "Новохопёрск",
        "Острогожск",
        "Павловск",
        "Поворино",
        "Россошь",
        "Семилуки",
        "Эртиль"
    ]
    
    var townsDagestan  = [
        "Буйнакск",
        "Дагестанские Огни",
        "Дербент",
        "Избербаш",
        "Каспийск",
        "Кизилюрт",
        "Кизляр",
        "Махачкала",
        "Хасавюрт",
        "Южно-Сухокумск"
    ]
    
    var townsEvr  = [
        "Биробиджан",
        "Облучье"
    ]
    
    var townsTransbaikal  = [
        "Балей",
        "Борзя",
        "Краснокаменск",
        "Могоча",
        "Нерчинск",
        "Петровск-Забайкальский",
        "Сретенск",
        "Хилок",
        "Чита",
        "Шилка"
    ]
    
    var townsIvanovsk  = [
        "Вичуга",
        "Гаврилов Посад",
        "Заволжск",
        "Иваново",
        "Кинешма",
        "Комсомольск",
        "Кохма",
        "Наволоки",
        "Плёс",
        "Приволжск",
        "Пучеж",
        "Родники",
        "Тейково",
        "Фурманов",
        "Шуя",
        "Южа",
        "Юрьевец"
    ]
    
    var townsIngushetia  = [
        "Карабулак",
        "Магас",
        "Малгобек",
        "Назрань",
        "Сунжа"
    ]
    
    var townsIrkutsk  = [
        "Алзамай",
        "Ангарск",
        "Байкальск",
        "Бирюсинск",
        "Бодайбо",
        "Братск",
        "Вихоревка",
        "Железногорск-Илимский",
        "Зима",
        "Иркутск",
        "Киренск",
        "Нижнеудинск",
        "Саянск",
        "Свирск",
        "Слюдянка",
        "Тайшет",
        "Тулун",
        "Усолье-Сибирское",
        "Усть-Илимск",
        "Усть-Кут",
        "Черемхово",
        "Шелехов"
    ]
    
    var townsKabardinoBalkaria  = [
        "Баксан",
        "Майский",
        "Нальчик",
        "Нарткала",
        "Прохладный",
        "Терек",
        "Тырныауз",
        "Чегем"
    ]
    
    var townsKaliningrad  = [
        "Багратионовск",
        "Балтийск",
        "Гвардейск",
        "Гурьевск",
        "Гусев",
        "Зеленоградск",
        "Калининград",
        "Краснознаменск",
        "Ладушкин",
        "Мамоново",
        "Неман",
        "Нестеров",
        "Озёрск",
        "Пионерский",
        "Полесск",
        "Правдинск",
        "Приморск",
        "Светлогорск",
        "Светлый",
        "Славск",
        "Советск",
        "Черняховск"
    ]
    
    var townsKalmykia  = [
        "Городовиковск",
        "Лагань",
        "Элиста"
    ]
    
    var townsKaluga  = [
        "Балабаново",
        "Белоусово",
        "Боровск",
        "Ермолино",
        "Жиздра",
        "Жуков",
        "Калуга",
        "Киров",
        "Козельск",
        "Кондрово",
        "Кремёнки",
        "Людиново",
        "Малоярославец",
        "Медынь",
        "Мещовск",
        "Мосальск",
        "Обнинск",
        "Сосенский",
        "Спас-Деменск",
        "Сухиничи",
        "Таруса",
        "Юхнов"
    ]
    
    var townsKamchatka  = [
        "Вилючинск",
        "Елизово",
        "Петропавловск-Камчатский",
        "Карачаевск",
        "Теберда",
        "Усть-Джегута",
        "Черкесск"
    ]
    
    var townsKarachayCherkessia  = [
        "Карачаевск",
        "Теберда",
        "Усть-Джегута",
        "Черкесск"
    ]
    
    var townsKarelia  = [
        "Беломорск",
        "Кемь",
        "Кондопога",
        "Костомукша",
        "Лахденпохья",
        "Медвежьегорск",
        "Олонец",
        "Петрозаводск",
        "Питкяранта",
        "Пудож",
        "Сегежа",
        "Сортавала",
        "Суоярви"
    ]
    
    var townsKemerov  = [
        "Анжеро-Судженск",
        "Белово",
        "Берёзовский",
        "Гурьевск",
        "Калтан",
        "Кемерово",
        "Киселёвск",
        "Ленинск-Кузнецкий",
        "Мариинск",
        "Междуреченск",
        "Мыски",
        "Новокузнецк",
        "Осинники",
        "Полысаево",
        "Прокопьевск",
        "Салаир",
        "Тайга",
        "Таштагол",
        "Топки",
        "Юрга"
    ]
    
    var townsKirov  = [
        "Белая Холуница",
        "Вятские Поляны",
        "Зуевка",
        "Киров",
        "Кирово-Чепецк",
        "Кирс",
        "Котельнич",
        "Луза",
        "Малмыж",
        "Мураши",
        "Нолинск",
        "Омутнинск",
        "Орлов",
        "Слободской",
        "Советск",
        "Сосновка",
        "Уржум",
        "Яранск"
    ]
    
    var townsKomi  = [
        "Воркута",
        "Вуктыл",
        "Емва",
        "Инта",
        "Микунь",
        "Печора",
        "Сосногорск",
        "Сыктывкар",
        "Усинск",
        "Ухта"
    ]
    
    var townsKostroma  = [
        "Буй",
        "Волгореченск",
        "Галич",
        "Кологрив",
        "Кострома",
        "Макарьев",
        "Мантурово",
        "Нерехта",
        "Нея",
        "Солигалич",
        "Чухлома",
        "Шарья"
    ]
    
    var townsKrasnodar  = [
        "Абинск",
        "Анапа",
        "Апшеронск",
        "Армавир",
        "Белореченск",
        "Геленджик",
        "Горячий Ключ",
        "Гулькевичи",
        "Ейск",
        "Кореновск",
        "Краснодар",
        "Кропоткин",
        "Крымск",
        "Курганинск",
        "Лабинск",
        "Новокубанск",
        "Новороссийск",
        "Приморско-Ахтарск",
        "Славянск-на-Кубани",
        "Сочи",
        "Темрюк",
        "Тимашёвск",
        "Тихорецк",
        "Туапсе",
        "Усть-Лабинск",
        "Хадыженск"
    ]
    
    var townsKrasnoyarsk  = [
        "Артёмовск",
        "Ачинск",
        "Боготол",
        "Бородино",
        "Дивногорск",
        "Дудинка",
        "Енисейск",
        "Железногорск",
        "Заозёрный",
        "Зеленогорск",
        "Игарка",
        "Иланский",
        "Канск",
        "Кодинск",
        "Красноярск",
        "Лесосибирск",
        "Минусинск",
        "Назарово",
        "Норильск",
        "Сосновоборск",
        "Ужур",
        "Уяр",
        "Шарыпово"
    ]
    
    var townsKrim  = [
        "Алупка",
        "Алушта",
        "Армянск",
        "Бахчисарай",
        "Белогорск",
        "Джанкой",
        "Евпатория",
        "Керчь",
        "Красноперекопск",
        "Саки",
        "Симферополь",
        "Старый Крым",
        "Судак",
        "Феодосия",
        "Щелкино",
        "Ялта"
    ]
    
    var townsKurgan  = [
        "Далматово",
        "Катайск",
        "Курган",
        "Куртамыш",
        "Макушино",
        "Петухово",
        "Шадринск",
        "Шумиха",
        "Щучье"
    ]
    
    var townsKursk  = [
        "Дмитриев",
        "Железногорск",
        "Курск",
        "Курчатов",
        "Льгов",
        "Обоянь",
        "Рыльск",
        "Суджа",
        "Фатеж",
        "Щигры"
    ]
    
    var townsLeningrad  = [
        "Бокситогорск",
        "Волосово",
        "Волхов",
        "Всеволожск",
        "Выборг",
        "Высоцк",
        "Гатчина",
        "Ивангород",
        "Каменногорск",
        "Кингисепп",
        "Кириши",
        "Кировск",
        "Коммунар",
        "Кудрово",
        "Лодейное Поле",
        "Луга",
        "Любань",
        "Мурино",
        "Никольское",
        "Новая Ладога",
        "Отрадное",
        "Пикалёво",
        "Подпорожье",
        "Приморск",
        "Приозерск",
        "Санкт-Петербург",
        "Светогорск",
        "Сертолово",
        "Сланцы",
        "Сосновый Бор",
        "Сясьстрой",
        "Тихвин",
        "Тосно",
        "Шлиссельбург"
    ]
    
    var townsLipetsk  = [
        "Грязи",
        "Данков",
        "Елец",
        "Задонск",
        "Лебедянь",
        "Липецк",
        "Усмань",
        "Чаплыгин"
    ]
    
    var townsMagadan  = [
        "Магадан",
        "Сусуман"
    ]
    
    var townsMariEl  = [
        "Волжск",
        "Звенигово",
        "Йошкар-Ола",
        "Козьмодемьянск"
    ]
    
    var townsMordovia  = [
        "Ардатов",
        "Инсар",
        "Ковылкино",
        "Краснослободск",
        "Рузаевка",
        "Саранск",
        "Темников"
    ]
    
    var townsMoskow  = [
        "Апрелевка",
        "Балашиха",
        "Белоозёрский",
        "Бронницы",
        "Верея",
        "Видное",
        "Волоколамск",
        "Воскресенск",
        "Высоковск",
        "Голицыно",
        "Дедовск",
        "Дзержинский",
        "Дмитров",
        "Долгопрудный",
        "Домодедово",
        "Дрезна",
        "Дубна",
        "Егорьевск",
        "Жуковский",
        "Зарайск",
        "Звенигород",
        "Ивантеевка",
        "Истра",
        "Кашира",
        "Клин",
        "Коломна",
        "Королёв",
        "Котельники",
        "Красноармейск",
        "Красногорск",
        "Краснозаводск",
        "Краснознаменск",
        "Кубинка",
        "Куровское",
        "Ликино-Дулёво",
        "Лобня",
        "Лосино-Петровский",
        "Луховицы",
        "Лыткарино",
        "Люберцы",
        "Можайск",
        "Москва",
        "Мытищи",
        "Наро-Фоминск",
        "Ногинск",
        "Одинцово",
        "Озёры",
        "Орехово-Зуево",
        "Павловский Посад",
        "Пересвет",
        "Подольск",
        "Протвино",
        "Пушкино",
        "Пущино",
        "Раменское",
        "Реутов",
        "Рошаль",
        "Руза",
        "Сергиев Посад",
        "Серпухов",
        "Солнечногорск",
        "Старая Купавна",
        "Ступино",
        "Талдом",
        "Фрязино",
        "Химки",
        "Хотьково",
        "Черноголовка",
        "Чехов",
        "Шатура",
        "Щёлково",
        "Электрогорск",
        "Электросталь",
        "Электроугли",
        "Яхрома"
    ]
    
    var townsMurmansk  = [
        "Апатиты",
        "Гаджиево",
        "Заозёрск",
        "Заполярный",
        "Кандалакша",
        "Кировск",
        "Ковдор",
        "Кола",
        "Мончегорск",
        "Мурманск",
        "Оленегорск",
        "Островной",
        "Полярные Зори",
        "Полярный",
        "Североморск",
        "Снежногорск"
    ]
    
    var townsNenetsk  = [
        "Нарьян-Мар"
    ]
    
    var townsNizhny = [
        "Арзамас",
        "Балахна",
        "Богородск",
        "Бор",
        "Ветлуга",
        "Володарск",
        "Ворсма",
        "Выкса",
        "Горбатов",
        "Городец",
        "Дзержинск",
        "Заволжье",
        "Княгинино",
        "Кстово",
        "Кулебаки",
        "Лукоянов",
        "Лысково",
        "Навашино",
        "Нижний Новгород",
        "Павлово",
        "Первомайск",
        "Перевоз",
        "Саров",
        "Семёнов",
        "Сергач",
        "Урень",
        "Чкаловск",
        "Шахунья"
    ]
    
    var townsNovgorod  = [
        "Боровичи",
        "Валдай",
        "Великий Новгород",
        "Малая Вишера",
        "Окуловка",
        "Пестово",
        "Сольцы",
        "Старая Русса",
        "Холм",
        "Чудово"
    ]
    
    var townsNovosibirsk  = [
        "Барабинск",
        "Бердск",
        "Болотное",
        "Искитим",
        "Карасук",
        "Каргат",
        "Куйбышев",
        "Купино",
        "Новосибирск",
        "Обь",
        "Татарск",
        "Тогучин",
        "Черепаново",
        "Чулым"
    ]
    
    var townsOmsk  = [
        "Исилькуль",
        "Калачинск",
        "Называевск",
        "Омск",
        "Тара",
        "Тюкалинск"
    ]
    
    var townsOrenburg  = [
        "Абдулино",
        "Бугуруслан",
        "Бузулук",
        "Гай",
        "Кувандык",
        "Медногорск",
        "Новотроицк",
        "Оренбург",
        "Орск",
        "Соль-Илецк",
        "Сорочинск",
        "Ясный"
    ]
    
    var townsOrlov  = [
        "Болхов",
        "Дмитровск",
        "Ливны",
        "Малоархангельск",
        "Мценск",
        "Новосиль",
        "Орёл"
    ]
    
    var townsPenza  = [
        "Белинский",
        "Городище",
        "Заречный",
        "Каменка",
        "Кузнецк",
        "Нижний Ломов",
        "Никольск",
        "Пенза",
        "Сердобск",
        "Спасск",
        "Сурск"
    ]
    
    var townsPerm  = [
        "Александровск",
        "Березники",
        "Верещагино",
        "Горнозаводск",
        "Гремячинск",
        "Губаха",
        "Добрянка",
        "Кизел",
        "Красновишерск",
        "Краснокамск",
        "Кудымкар",
        "Кунгур",
        "Лысьва",
        "Нытва",
        "Оса",
        "Оханск",
        "Очёр",
        "Пермь",
        "Соликамск",
        "Усолье",
        "Чайковский",
        "Чердынь",
        "Чёрмоз",
        "Чернушка",
        "Чусовой"
    ]
    
    var townsPrimorsk  = [
        "Арсеньев",
        "Артём",
        "Большой Камень",
        "Владивосток",
        "Дальнегорск",
        "Дальнереченск",
        "Лесозаводск",
        "Находка",
        "Партизанск",
        "Спасск-Дальний",
        "Уссурийск",
        "Фокино"
    ]
    
    var townsPskov  = [
        "Великие Луки",
        "Гдов",
        "Дно",
        "Невель",
        "Новоржев",
        "Новосокольники",
        "Опочка",
        "Остров",
        "Печоры",
        "Порхов",
        "Псков",
        "Пустошка",
        "Пыталово",
        "Себеж"
    ]
    
    var townsRostov  = [
        "Азов",
        "Аксай",
        "Батайск",
        "Белая Калитва",
        "Волгодонск",
        "Гуково",
        "Донецк",
        "Зверево",
        "Зерноград",
        "Каменск-Шахтинский",
        "Константиновск",
        "Красный Сулин",
        "Миллерово",
        "Морозовск",
        "Новочеркасск",
        "Новошахтинск",
        "Пролетарск",
        "Ростов-на-Дону",
        "Сальск",
        "Семикаракорск",
        "Таганрог",
        "Цимлянск",
        "Шахты"
    ]
    
    var townsRyazan  = [
        "Касимов",
        "Кораблино",
        "Михайлов",
        "Новомичуринск",
        "Рыбное",
        "Ряжск",
        "Рязань",
        "Сасово",
        "Скопин",
        "Спас-Клепики",
        "Спасск-Рязанский",
        "Шацк"
    ]
    
    var townsSamara  = [
        "Жигулёвск",
        "Кинель",
        "Нефтегорск",
        "Новокуйбышевск",
        "Октябрьск",
        "Отрадный",
        "Похвистнево",
        "Самара",
        "Сызрань",
        "Тольятти",
        "Чапаевск"
    ]
    
    var townsSaratov  = [
        "Аркадак",
        "Аткарск",
        "Балаково",
        "Балашов",
        "Вольск",
        "Ершов",
        "Калининск",
        "Красноармейск",
        "Красный Кут",
        "Маркс",
        "Новоузенск",
        "Петровск",
        "Пугачёв",
        "Ртищево",
        "Саратов",
        "Хвалынск",
        "Шиханы",
        "Энгельс"
    ]
    
    var townsSahalin  = [
        "Александровск-Сахалинский",
        "Анива",
        "Долинск",
        "Корсаков",
        "Курильск",
        "Макаров",
        "Невельск",
        "Оха",
        "Поронайск",
        "Северо-Курильск",
        "Томари",
        "Углегорск",
        "Холмск",
        "Южно-Сахалинск"
    ]
    
    var townsSverdlov  = [
        "Алапаевск",
        "Арамиль",
        "Артёмовский",
        "Асбест",
        "Берёзовский",
        "Богданович",
        "Верхний Тагил",
        "Верхняя Пышма",
        "Верхняя Салда",
        "Верхняя Тура",
        "Верхотурье",
        "Волчанск",
        "Дегтярск",
        "Екатеринбург",
        "Заречный",
        "Ивдель",
        "Ирбит",
        "Каменск-Уральский",
        "Камышлов",
        "Карпинск",
        "Качканар",
        "Кировград",
        "Краснотурьинск",
        "Красноуральск",
        "Красноуфимск",
        "Кушва",
        "Лесной",
        "Михайловск",
        "Невьянск",
        "Нижние Серги",
        "Нижний Тагил",
        "Нижняя Салда",
        "Нижняя Тура",
        "Новая Ляля",
        "Новоуральск",
        "Первоуральск",
        "Полевской",
        "Ревда",
        "Реж",
        "Североуральск",
        "Серов",
        "Среднеуральск",
        "Сухой Лог",
        "Сысерть",
        "Тавда",
        "Талица",
        "Туринск"
    ]
    
    var townsSevastopol  = [
        "Севастополь"
    ]
    
    var townsNorthOssetia  = [
        "Алагир",
        "Ардон",
        "Беслан",
        "Владикавказ",
        "Дигора",
        "Моздок"
    ]
    
    var townsSmolensk  = [
        "Велиж",
        "Вязьма",
        "Гагарин",
        "Демидов",
        "Десногорск",
        "Дорогобуж",
        "Духовщина",
        "Ельня",
        "Починок",
        "Рославль",
        "Рудня",
        "Сафоново",
        "Смоленск",
        "Сычёвка",
        "Ярцево"
    ]
    
    var townsStavropol  = [
        "Благодарный",
        "Будённовск",
        "Георгиевск",
        "Ессентуки",
        "Железноводск",
        "Зеленокумск",
        "Изобильный",
        "Ипатово",
        "Кисловодск",
        "Лермонтов",
        "Минеральные Воды",
        "Михайловск",
        "Невинномысск",
        "Нефтекумск",
        "Новоалександровск",
        "Новопавловск",
        "Пятигорск",
        "Светлоград",
        "Ставрополь"
    ]
    
    var townsTambov  = [
        "Жердевка",
        "Кирсанов",
        "Котовск",
        "Мичуринск",
        "Моршанск",
        "Рассказово",
        "Тамбов",
        "Уварово"
    ]
    
    var townsTatarstan = [
        "Агрыз",
        "Азнакаево",
        "Альметьевск",
        "Арск",
        "Бавлы",
        "Болгар",
        "Бугульма",
        "Буинск",
        "Елабуга",
        "Заинск",
        "Зеленодольск",
        "Иннополис",
        "Казань",
        "Кукмор",
        "Лаишево",
        "Лениногорск",
        "Мамадыш",
        "Менделеевск",
        "Мензелинск",
        "Набережные Челны",
        "Нижнекамск",
        "Нурлат",
        "Тетюши",
        "Чистополь"
    ]
    
    var townsTver  = [
        "Андреаполь",
        "Бежецк",
        "Белый",
        "Бологое",
        "Весьегонск",
        "Вышний Волочёк",
        "Западная Двина",
        "Зубцов",
        "Калязин",
        "Кашин",
        "Кимры",
        "Конаково",
        "Красный Холм",
        "Кувшиново",
        "Лихославль",
        "Нелидово",
        "Осташков",
        "Ржев",
        "Старица",
        "Тверь",
        "Торжок",
        "Торопец",
        "Удомля"
    ]
    
    var townsTomsk  = [
        "Асино",
        "Кедровый",
        "Колпашево",
        "Северск",
        "Стрежевой",
        "Томск"
    ]
    
    var townsTula  = [
        "Алексин",
        "Белёв",
        "Богородицк",
        "Болохово",
        "Венёв",
        "Донской",
        "Ефремов",
        "Кимовск",
        "Киреевск",
        "Липки",
        "Новомосковск",
        "Плавск",
        "Советск",
        "Суворов",
        "Тула",
        "Узловая",
        "Чекалин",
        "Щёкино",
        "Ясногорск"
    ]
    
    var townsTiva  = [
        "Ак-Довурак",
        "Кызыл",
        "Туран",
        "Чадан",
        "Шагонар"
    ]
    
    var townsTumen  = [
        "Заводоуковск",
        "Ишим",
        "Тобольск",
        "Тюмень",
        "Ялуторовск"
    ]
    
    var townsUdmurtia  = [
        "Воткинск",
        "Глазов",
        "Ижевск",
        "Камбарка",
        "Можга",
        "Сарапул"
    ]
    
    var townsUlyanovsk  = [
        "Барыш",
        "Димитровград",
        "Инза",
        "Новоульяновск",
        "Сенгилей",
        "Ульяновск"
    ]
    
    var townsHabarovsk  = [
        "Амурск",
        "Бикин",
        "Вяземский",
        "Комсомольск-на-Амуре",
        "Николаевск-на-Амуре",
        "Советская Гавань",
        "Хабаровск",
        "Абакан"
    ]
    
    var townsKhakassia  = [
        "Абакан",
        "Саяногорск",
        "Сорск",
        "Черногорск"
    ]
    
    var townsKhantyMansiysk  = [
        "Белоярский",
        "Когалым",
        "Лангепас",
        "Лянтор",
        "Мегион",
        "Нефтеюганск",
        "Нижневартовск",
        "Нягань",
        "Покачи",
        "Пыть-Ях",
        "Радужный",
        "Советский",
        "Сургут",
        "Урай",
        "Ханты-Мансийск",
        "Югорск"
    ]
    
    var townsChelyabinsk  = [
        "Аша",
        "Бакал",
        "Верхнеуральск",
        "Верхний Уфалей",
        "Еманжелинск",
        "Златоуст",
        "Карабаш",
        "Карталы",
        "Касли",
        "Катав-Ивановск",
        "Копейск",
        "Коркино",
        "Куса",
        "Кыштым",
        "Магнитогорск",
        "Миасс",
        "Миньяр",
        "Нязепетровск",
        "Озёрск",
        "Пласт",
        "Сатка",
        "Сим",
        "Снежинск",
        "Трёхгорный",
        "Троицк",
        "Усть-Катав",
        "Чебаркуль",
        "Челябинск",
        "Южноуральск",
        "Юрюзань"
    ]
    
    var townsChechnya  = [
        "Аргун",
        "Грозный",
        "Гудермес",
        "Курчалой",
        "Урус-Мартан",
        "Шали"
    ]
    
    var townsChuvashia  = [
        "Алатырь",
        "Канаш",
        "Козловка",
        "Мариинский Посад",
        "Новочебоксарск",
        "Цивильск",
        "Чебоксары",
        "Шумерля",
        "Ядрин"
    ]
    
    var townsChuko  = [
        "Анадырь",
        "Билибино",
        "Певек"
    ]
    
    var townsYakutia  = [
        "Алдан",
        "Верхоянск",
        "Вилюйск",
        "Ленск",
        "Мирный",
        "Нерюнгри",
        "Нюрба",
        "Олёкминск",
        "Покровск",
        "Среднеколымск",
        "Томмот",
        "Удачный",
        "Якутск"
    ]
    
    var townsYamalNenets  = [
        "Губкинский",
        "Лабытнанги",
        "Муравленко",
        "Надым",
        "Новый Уренгой",
        "Ноябрьск",
        "Салехард",
        "Тарко-Сале"
    ]
    
    var townsYaroslavl  = [
        "Гаврилов-Ям",
        "Данилов",
        "Любим",
        "Мышкин",
        "Переславль-Залесский",
        "Пошехонье",
        "Ростов",
        "Рыбинск",
        "Тутаев",
        "Углич",
        "Ярославль"
    ]
    
}
